//HELOWRLD  JOB (HELOWRLD),'HELLO WORLD',CLASS=A,
//             MSGCLASS=X,MSGLEVEL=0,NOTIFY=&SYSUID
//*
//JOBLIB   DD DSN={{dsn.object.library}},DISP=SHR
//*
//STEP0001 EXEC PGM=HELOWRLD
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=*
//
