000100 IDENTIFICATION DIVISION.                                         00010006
000200 PROGRAM-ID. HELOWRLD.                                            00020006
000300*                                                                 00030006
000400 PROCEDURE DIVISION.                                              00040006
000600     DISPLAY "HELLO WORLD".                                       00060011
000700     STOP RUN.                                                    00070011
